{"last_run_values": [["DEEPAKFERT", "https://s3.tradingview.com/v/v5gYTerZ_mid.png", "Deepak Fertilizers", "1W", "Justtolearn", 1671622277.0, "🟢", "The stock is currently testing it's supply zone which is a power zone, good possibility of reversal in price from the current levels. Investment horizon should be 1-2 quarters. \n\nNot a recommendation, just for learning."], ["PONNIERODE", "https://s3.tradingview.com/4/4bWJ1RpN_mid.png", "#Ponni Sugar", "1D", "Shiv_Singh", 1671620944.0, "Not Mentioned By Author", "#Ponni Sugar\nCMP:388.75 @21 Dec 2022\nSimple exit rule from stock. \nfollow 20 ema.\nif price closed below 20ema -exit"], ["HDFCBANK", "https://s3.tradingview.com/v/v6zt3Whn_mid.png", "HDFCBANK long", "1D", "BharatAsani", 1671620725.0, "🟢", "HDFC Bank is looking bullish as long as it closes above 1643 which is the previous month high. A strong closing above will take it to 1725 where liquidity in form of stops is resting. Any close below 1600 will invalidate this view."], ["RELIANCE", "https://s3.tradingview.com/l/LUPkapKJ_mid.png", "RIL all 3 scenarios mapped out", "1D", "BharatAsani", 1671620590.0, "Not Mentioned By Author", "RIL has taken out both sell side liquidity & buy side liquidity. Currently its trading in an imbalance zone, from here I can see only 3 scenarios playing. \n\nScenario 1 : The price does not close below the imbalance zone & shows bullishness from here, then it should make a new ATH.\nScenario 2 : The price goes below the imbalance & grabs more liquidity near the..."], ["ICICIBANK", "https://s3.tradingview.com/i/ixC2ZXQ5_mid.png", "ICICIBANK at make it or break it moment", "1D", "BharatAsani", 1671620490.0, "Not Mentioned By Author", "ICICI is getting support at an upward trendline, If the support holds we can expect it to head above 950 levels if it fails then we can see it fall below 900 levels. next few days PA will be very crucial.\n\nNote : India Inflation numbers coming out today & US inflation numbers coming out tomorrow."], ["JINDWORLD", "https://s3.tradingview.com/5/5d3yNsqV_mid.png", "JINDWORLD bullish Flag breakout done", "1D", "mdamin786", 1671620400.0, "🟢", "JINDWORLD bullish Flag breakout done can look for long term tp of 500-523"], ["SBIN", "https://s3.tradingview.com/f/F2PRuRlc_mid.png", "SBI trend line break", "60", "BharatAsani", 1671620345.0, "🔴", "SBI has broken the trend line support & is now heading towards the demand zone, it has already shown a bounce from the zone earlier. Demand zones rarely work as support multiple times so the chances of it breaking down are higher than it bouncing from there. Once it breaks the demand zone it will fall quickly."], ["HDFCBANK", "https://s3.tradingview.com/v/vJbMnKFk_mid.png", "HDFC Bank rangebound - wait for break", "1D", "BharatAsani", 1671620196.0, "Not Mentioned By Author", "HDFC Bank is trading in a range since 14 Nov 22. So far it is respecting the demand zone & is bouncing every time it enters it. I would prefer it to break the top side or the bottom side of the range with good volumes before taking any position. If you like to play ranges then you can sell at the top & buy at the bottom of the range."]]}