{"last_run_values": [["HDFC", "https://s3.tradingview.com/m/mg0UtgnS_mid.png", "HDFC Bullish Rejection", "1W", "vipulmehta817", 1671369172.0, "🔴", "The weekly chart of HDFC is exhibiting rejection of the bulls for the last five weeks. This can also be seen in the rising wedge which is forming on the Daily chart.\nFurther, this type of price action is also forming at the completion of 61.8 AB=CD harmonic pattern.\n\nThe thesis is bearish with target of point B of the harmonic pattern at 2507."], ["SUNCLAYLTD", "https://s3.tradingview.com/t/T2YL8r9i_mid.png", "#SUNDARAMCLAYTON  #BOOM BAAM  #23/10/21", "1W", "lp9", 1671368017.0, "🟢", "BULLISH .\nTRADE wisely.\nWE CAN JUST PREDICT.\nDisclaimer: I am not a SEBI registered advisor , so before entering on my view plz ask your SEBI Registered Advisor . Profit is your and loss is your."], ["M_M", "https://s3.tradingview.com/c/ca1oB9LU_mid.png", "Trading in the zone", "1D", "TraderSunil30", 1671367111.0, "Not Mentioned By Author", "Stock has been in a range for a while from August 2022 till now \nStart of 2023 is gonna be  a trending move for M&M.\nCurrently Either there is an  accumulation or Distribution phase  going on.\nA close below  1215  will confirm that the stock was in  Distribution phase  and a sell off can be seen in this stock. \nIf Stock moves above 1330 , Fresh buying towards New..."], ["BAJAJHIND", "https://s3.tradingview.com/7/7PPTfi6H_mid.png", "BAJAJHind: Breakout Ready with Very High Volume", "1W", "pradipandsuvra", 1671366871.0, "🟢", "Please have a look at the  NSE:BAJAJHIND . It has such a Very Big Volume spike with the RSI is shooting the roof.\n\nAnd it is just crossed the big-time resistance with a marubozu candle (actually upper circuit in Friday).\n\nWith a few months of holding it can double the investment."], ["AXISBANK", "https://s3.tradingview.com/x/XqoJQOO3_mid.png", "Axis bank top around 950", "240", "Krishna_Bhandari", 1671366800.0, "🔴", "* divergence on 4 hr seen\n* rsi overstretched, in over bough territory \n* Moving average, rsi crossover\n* harmonic reversal patterns"], ["GPIL", "https://s3.tradingview.com/i/idy9ahg8_mid.png", "GPIL swing idea (for study purpose)", "240", "bilbo_baggin", 1671364679.0, "Not Mentioned By Author", "If manages to sustain above 387 then can expect first target of 414. \nsecond target 454. can expect small selling in between targets.\n\nStrongly suggest to study before taking any action."]]}