{"last_run_values": [["GPPL", "https://s3.tradingview.com/s/Sx2DMBim_mid.png", "GUJARAT PIPAVAV", "1W", "GyanendraMishraa", 1670752208.0, "🟢", "It can be taken at current market price. it looks good and it can give good momentum in coming days. this not buy or sell call kindly do your own research."], ["BHARATGEAR", "https://s3.tradingview.com/f/FCCW4Yby_mid.png", "BHARATGEAR WEEKLY CHART", "1W", "suyashkumar09", 1670752071.0, "🟢", "bharat gear making flag and pole pattern.\nupside breakout awaited \nif breaks 140-147 levels on weekly chart \nthen 230-260 possible \n#investement stock"], ["LTIM", "https://s3.tradingview.com/6/6diceXcl_mid.png", "LTIMINDTREE", "1D", "vijaysmuley", 1670752044.0, "🟢", "It's best stock in IT sector, currently in bearish mode, if showing any price action on below support can add position step by step.\nSupport-1-4250\nSupport -2-3835"], ["PERSISTENT", "https://s3.tradingview.com/5/5HguKIID_mid.png", "PERSISTENT FOR A SWING", "1D", "piyushkr915", 1670751207.0, "🟢", "I Have Been Observing PERSISTENT for Several Day For Taking Stock Option And Swing.\nIt Is Trying To Follow a Very Popular Pattern Cup And Handle For Bullish Continuation. Currently, It Is In Retracement Leg And What I Expect From Here Is To Show It A Up Move.\nLet Me Know In Comment If Anyone Have Any Suggestions.\n\n\nDisclaimer: This Is My Own Opinion Do Not Try To..."], ["ICICIBANK", "https://s3.tradingview.com/p/pf4rQjU0_mid.png", "Long Trade in ICICI Bank", "75", "nikunjagrawalla05", 1670749957.0, "🟢", "Very Good Risk Reward Trade. ICICI Bank has been Outperforming Bank Nifty from a long time, so according to me this is the time for ICICI Bank to step in further and help Bank Nifty to move higher"], ["TATASTEEL", "https://s3.tradingview.com/i/i7YcysrH_mid.png", "Tata Steel Long", "60", "Hardtalks", 1670749190.0, "🟢", "We have plotted regression line, anchored VWAP signal and Elliot wave in hourly time frame. Stock is having robust fundamental strength with PE of mere 5.63. Anyone can go long in Tata Steel , if stock is goes above VWAP line i.e. INR 111.10 . Stock is having potential to go up up to INR 119-125 in near future . \n\nhope, you are enjoying my analysis, please share,..."]]}