{"last_run_values": [["APLAPOLLO", "https://s3.tradingview.com/e/egb4q5Uu_mid.png", "APL Apollo  Tubes Cmp 1185 VOLUME RISE", "1D", "SHEETAL_UDESHI", 1670056210.0, "🟢", "APL Apollo  Tubes Cmp 1185\n\n1. Triangle BO @ 1162\n2. Price Rise with Volume Rise\n3. RSI BO\n\nBuy @ CMP for target 1275-1350-1485 SL 1100\n\n\nDisclaimer :\nI am not a SEBI registered Analyst so please do your own Analysis before taking any action. \nThe above view is shared just for educational purpose. \nBy no means shall be responsible for any losses amounting out of..."], ["GAIL", "https://s3.tradingview.com/m/m9PX9RZS_mid.png", "GAIL - Short", "1D", "Sniper-Traders", 1670054457.0, "Not Mentioned By Author", "A short-term reversal move can be expected due to profit booking. The market has also peaked and there is a chance for the crude price to increase in the coming weeks. This can also affect the stock price adversely."], ["L_TFH", "https://s3.tradingview.com/a/aoneQ4vR_mid.png", "Symmetrical Triangle Breakout", "1W", "tusharvispute1", 1670054291.0, "🟢", "L&TH Ltd. on the weekly chart has decisively broken out above the \"Symmetrical triangle\" pattern which was in formation from Nov, 2021\n\nThis breakout is accompanied with rising volume, which normally dined up during the consolidation pattern formation.\n\nThe weekly \"Bollinger Band\" generated a buy signal as stock closed above the upper bollinger band.\n\nThe weekly..."], ["SKIPPER", "https://s3.tradingview.com/n/N7NpXUBP_mid.png", "Skipper ltd", "1D", "RK_Charts", 1670054168.0, "🟢", "Skipper ltd, this stock is looking in good momentum on daily, weekly, and on monthly too, along with cup and handle chart pattern breakout along with good intensity of volumes too, also wave structure is suggesting bullish bias at the same time, one can go long at current levels and can add more in dips (if any), overall, its looking good candidate for longs...."], ["PFC", "https://s3.tradingview.com/n/NkYgNkUT_mid.png", "12 Years Multiyear Breakout at PFC", "1W", "ratneshr", 1670053663.0, "🟢", "12 Years #Multiyear #Breakout at #PFC (Power Finance Corporation Ltd) Weekly Chart. Its #Outperformed #Nifty\n\nBSE: 532810 / NSE : PFC\n\nWhat Is the Inverse Head and Shoulders?\n\nAn inverse head and shoulders, also called a \"head and shoulders bottom\", is similar to the standard head and shoulders pattern, but inverted: with the head and shoulders top used to predict..."]]}