{"last_run_values": [["KOTAKBANK", "https://s3.tradingview.com/n/NDPDRH7I_mid.png", "kotan will soon will big move", "1D", "AJAYKANDRE", 1671129953.0, "🟢", "as K TECH FIN ipo going to list on month end, n it has strong fundametal balance sheet, kotak had aquire 10% stake last year...now kotak being in steady near 200 ema....today market fall 250 point but kotak remain stable....two days ago a large two block deal happened in kotak in single day....its shows kotak waiting for k tech fin ipo listing....it also has..."], ["AHLUCONT", "https://s3.tradingview.com/9/9uY0OMhV_mid.png", "Brokerages are bullish on this realty stock!", "1D", "AnalystPratik", 1671128661.0, "Not Mentioned By Author", "NSE:AHLUCONT \n\nThis company is a engineering and contracts player in the construction space\n\nIn terms of financials the company is debt free with high ROE ROCE numbers along with good interest coverage ratio\n\nTechnical charts suggest bullishness with price nearing all time highs backed by high volume\n\nRecent brokerage reports and ratings suggest good revenue..."], ["RELIANCE", "https://s3.tradingview.com/z/Z30pzg8i_mid.png", "16th DEC Reliance Industries Ltd. Buy or Sale", "15", "vahabsheikh", 1671127763.0, "🔴", "CMP: 2578\n\nReliance Industries Ltd is India`s largest private sector enterprise, with businesses in the energy and materials value chain.The company works under different business segments:Exploration and Production,Petroleum Refining and Marketing,Petrochemicals,Textiles and Retail.\n\nReliance currant given  breck out  Strong Support\n\n Sale Below 2585  Must See ..."], ["NFL", "https://s3.tradingview.com/p/pcQ7P3h4_mid.png", "TWO PROBABILITIES", "1D", "AMIT-RAJAN", 1671127441.0, "🟢", "Here I am sharing the daily chart of National fertilizer it gives a bullish breakout on daily time frame on horizontal resistance with good volume jump in it so what it could do next for us? what I analyze on this chart is that there are two probabilities sharing below\n\nProbability One-: It can god straight to target of 74 levels from current price which is about..."], ["GODFRYPHLP", "https://s3.tradingview.com/w/wWQ40hEM_mid.png", "GODFRYPHLP", "1D", "GyanendraMishraa", 1671127051.0, "🟢", "Breakout FROM 52week high on monthly bases\nthen formed a base on weekly time frame in rectangle and consolidated.\nnow breakout from rectangle as marked on chart and restested we can enter now.\nthis is not buy or sell cal do your own research before taking any trade. do consult your financial advisor"], ["TATACHEM", "https://s3.tradingview.com/j/Jkajtk2I_mid.png", "TATA CHEMICALS LTD : DOUBLE BOTTOM", "30", "SANJAYPATIDAR_", 1671126861.0, "🟢", "BSE:TATACHEM \n\nTata chem is formed a double bottom pattern at its major support zone.\nthe entry should be above 828 only with the measured move target expectation in short term. \n\nit have good support of daily TF.\n  \n\nHappy trading & Keep learning\nplease like and comment if you like our simple analysis."], ["BHARATFORG", "https://s3.tradingview.com/v/vW6UXRe0_mid.png", "BHARAT FORGE - TREND CONTINUATION PATTERN GUIDE", "1W", "SANJAYPATIDAR_", 1671126522.0, "🟢", "NSE:BHARATFORG \n\n \n \n What is trend continuation ? \nTrend continuation means when we are in uptrend and witness a healthy correction most likely sideways movement in a channel and it breaks the correction sideways zone with big momentum candles then it might be signaling a strong new up trend starting.\n\n #so lets see how we can play with trend continuation on a..."], ["GUJGASLTD", "https://s3.tradingview.com/v/vEcpegq2_mid.png", "GUJRAT GAS LTD - TRIANGLE", "1D", "SANJAYPATIDAR_", 1671126392.0, "🟢", "NSE:GUJGASLTD \n\nGujgas has been consolidating in a tight range on a daily timeframe and formed a triangle.\nit has a resistance of 528 if it breaks and closes above it on day TF then will enter above 530.\nCmp - 516\nmy stop - 497 \ntake profit marked on the chart and that's a good resistance too if it breaks then it can trigger a further move up.\n\n\n\n\nAlways trade..."]]}