{"last_run_values": [["HDFCAMC", "https://s3.tradingview.com/u/UtdYv6fU_mid.png", "Long trade in HDFC AMC, Breakout with good volumes", "1D", "aniketkulkarni500", 1670820078.0, "🟢", "NSE:HDFCAMC \n\nGood breakout above resistance zone with good volumes. Has also broken above R1 today too. Trading above all key MAs (20,50,100,200)\n\nKeeping a target at R3, which is also another potential supply zone, with an SL below the breakout candle's low gives a 1:1 RR trade if taken at current rates.\n\nAny entry on pullbacks will be even better in terms of RR."], ["SIEMENS", "https://s3.tradingview.com/s/sGwzTzWe_mid.png", "Siemens Breakout", "1D", "AMIT-RAJAN", 1670820019.0, "🟢", "Siemens India looks good on daily chart as it gives a breakout on falling resistance trendline and gives a good close above on that trendline and gives breakout too on the upper band of Bollinger band indicator too specifically in Red market like today, getting good jump in Volume bars is also indicating that it turns into bullish from sideways so we can see a..."], ["GODFRYPHLP", "https://s3.tradingview.com/u/uRnF34g1_mid.png", "Godfrey Phillips Long trade - Consolidation Breakout", "1D", "aniketkulkarni500", 1670819991.0, "🟢", "NSE:GODFRYPHLP \n\nThis stock has broken out of a bullish flag pattern, signalling a continuation of the ongoing bullish trend. Despite the selloff on the index, this stock has held strong on friday.\n\nBreakout occurred with good volumes\n\nSL can be taken below the breakout candle low, giving a R:R of 1:1.3, or an SL below the monthly pivot, which would give an R:R of..."], ["REDINGTON", "https://s3.tradingview.com/u/uEcPcVoJ_mid.png", "ALL TIME HIGH BREAKOUT", "1W", "AMIT-RAJAN", 1670819941.0, "🟢", "Here on weekly chart Redington gives a beautiful all time high Breakout and sustained above strongly on the basis of weekly closing above on that resistance trendline on coming Friday we can consider as a fresh entry in this stock, what I observed by the previous trend after breakout of all time high in this counter that it gives almost 60% runup after when that..."], ["LALPATHLAB", "https://s3.tradingview.com/6/6EwFvw3s_mid.png", "Go long for short term in Lalpath Labs", "1D", "mydoclaw", 1670819817.0, "🟢", "NSE:LALPATHLAB    Lal path labs is likely to go higher in short term and is making a long stride."], ["PSPPROJECT", "https://s3.tradingview.com/u/uSytY9jI_mid.png", "PSP project", "1D", "AJAY_M", 1670819643.0, "🟢", "PSP project given fresh breakout  Buy psp project @675 with sl 667"], ["HAL", "https://s3.tradingview.com/r/RrUwqUhY_mid.png", "HAL CONTINUATION TRADE", "1D", "stockartx", 1670819458.0, "🟢", "A continuation trade can be planned with small risk...\n\nChart is self explanatory. Levels of breakdown, possible down-moves (where stock may find support) and resistances (close above which, setup will be invalidated) are clearly defined.\n\nDisclaimer: This is for demonstration and educational purpose only. This is not buying or selling recommendations. I am not..."], ["HDFCBANK", "https://s3.tradingview.com/j/JzWqBvLw_mid.png", "HDFCBANK", "1W", "devbisht5453", 1670818847.0, "🟢", "Flag breakout in HDFCBANK moving for target of 1720...."], ["STAR", "https://s3.tradingview.com/b/bJdx5K9a_mid.png", "short term short opportunity in strides pharma", "15", "mydoclaw", 1670818627.0, "🔴", "NSE:STAR   Short term opportunity for shorters in case of a M shaped formation . Wait and take a small short."], ["AWL", "https://s3.tradingview.com/y/yySZrRAH_mid.png", "HEAD AND SHOULDER BREAKOUT (AWL)", "1D", "ketan_sartape", 1670817323.0, "Not Mentioned By Author", "Head And Shoulder Breakout\n\nCMP: 435\nTargets for Downside: 591 and 551\nSL: 671 Above Previous Swing High\n\nAWL Broke this years major support retested the support area and now heading to downside.\n\nDisclaimer: This is for educational purposes only, not any recommendations to buy or sell."]]}