{"last_run_values": [["HCLTECH", "https://s3.tradingview.com/n/nwTFkXUi_mid.png", "HCL Tech breakdown", "1D", "jatin_agarwal", 1670575667.0, "🔴", "There has been a massive breakdown on the charts of HCL Tech and this comes with other IT stocks correcting as well. The support of 1100 has been broken with a gap down and one needs to be careful in this script. While I believe a bottom was made a few months back in IT, this does not mean that IT stocks will rally and outperform. I maintain my view that time wise..."], ["PAYTM", "https://s3.tradingview.com/o/OaryYAle_mid.png", "Paytm Buyback announcement", "1D", "jatin_agarwal", 1670575489.0, "🔴", "Paytm announces a buyback but the share is struggling to keep up. It has barely crossed its resistance and has formed a doji which shows indecisiveness. Best to avoid this stock."], ["BHARATFORG", "https://s3.tradingview.com/e/ECG5MYIR_mid.png", "Bharat Forge", "1D", "jatin_agarwal", 1670574833.0, "🟢", "Bharat Forge looks like a strong chart in this market. Keep a stop loss at 825 and go long. Bharat Forge is an auto ancillary company and the company has three major products namely, Steel Forgings (97% of the revenues), Finished Machine Crankshafts and Front Axles Assembly and Components."], ["VIPIND", "https://s3.tradingview.com/d/DZXAVx0i_mid.png", "double bottom pattern VIPIND", "1D", "chart_analytics_kb", 1670573958.0, "🟢", "50 moving average is one of the most commonly used moving average and it acts as a really nice support.\nVIP had recently made a golden gross over and is then retraced back to its 50 moving average.\nIts has taken a good support at the 50 moving average by baking a double bottom.\nI prefer to put a stop little below the support and target for 2:1 ratio of the profit to loss"], ["JUBLPHARMA", "https://s3.tradingview.com/c/c5MGtDFe_mid.png", "Lets hold for a long term", "1W", "vkfincare09", 1670573947.0, "🟢", "It is trying to sustain above the line if did, then it will surely give upside move of up to 18% within a week or two\nthere is also a gap so it might go to fill and that will be the 1st target"], ["GSPL", "https://s3.tradingview.com/k/k4HEhdyu_mid.png", "double bottom pattern in GSPL", "1D", "chart_analytics_kb", 1670573384.0, "🟢", "One of the simplest and effective chart pattern is the double bottom or the W pattern \nrecently GSPL had made a double bottom and broke out the high of the W patter. \nlast resistance is broken and even retested . so long entry is a good idea with a target of double the height of the W pattern"], ["GUJGASLTD", "https://s3.tradingview.com/e/eNlvfINQ_mid.png", "accelerating triangle is GUJGASLTD", "1D", "chart_analytics_kb", 1670573268.0, "🟢", "triangles patterns  are one of the most reliable chart pattern \nGujarat gas is currently forming a accelerating triangle , I personally like prefer to go long on the accelerating triangles when break upside.\nI also prefer to place the stop loss at the triangle's last low and target at a fixed profit to loss ratio of 2:1."], ["JKCEMENT", "https://s3.tradingview.com/j/jBadPFuq_mid.png", "JKCEMENT registers a bullish breakout", "1D", "proanalyst", 1670572726.0, "🟢", "Forming a bullish price action sequence of higher highs at lows\nRegisters a bullish consolidation breakout that hints at the resumption of a strong uptrend\nTargets 3165-3269 Likely"]]}