{"last_run_values": [["EICHERMOT", "https://s3.tradingview.com/a/A7HdQKwJ_mid.png", "Breakout retest or fibo 0.618 support", "1W", "suhailafzalkhan", 1670770196.0, "🟢", "Eicher motors very good setup \nin an uptrend retest ATH breakout level \nand fibo 0.618 level \none can look for buy opportunity\n\nsl as mentioned or as per your system\n \n\ni am not a sebi register adviser \nits my own analysis \npls make sure you do your analysis dont jump on the trade"], ["ABCAPITAL", "https://s3.tradingview.com/8/8GzEK6Tw_mid.png", "AB Capital H&S Pattern on weekly Chart", "1W", "manishs1976", 1670770171.0, "🟢", "AB Capital On Inverse H&S Pattern On Weekly Chart & Ready To Break Out At 52 week high Level OF 139.70 Level , Pls Add To Watch List & Wait Above"], ["CUMMINSIND", "https://s3.tradingview.com/b/BmyZufZT_mid.png", "Cummins India near ATH!!", "1W", "manishs1976", 1670770125.0, "🟢", "Cummins India near ATH add to your watch list for breakout"], ["SUPRAJIT", "https://s3.tradingview.com/5/54NErrDX_mid.png", "#Suprajit #Buy", "1D", "MakarandK", 1670769974.0, "🟢", "Suprajit Eng 1D:  It is given range breakout with increase in volumes and held.  It is ready to be out of ellipse.  Ichimoku and BB is suggesting a strong buy.  Make entry around 340.  Strict SL 320."], ["VGUARD", "https://s3.tradingview.com/q/qdrnp5f8_mid.png", "#VGUARD", "1W", "subbu_1915", 1670769797.0, "🟢", "Stock is trading in a higher high channel maintaining its supportive trendline, ready to break its ATH."], ["GODFRYPHLP", "https://s3.tradingview.com/u/uRnF34g1_mid.png", "Godfrey Phillips Long trade - Consolidation Breakout", "1D", "aniketkulkarni500", 1670769796.0, "🟢", "NSE:GODFRYPHLP \n\nThis stock has broken out of a bullish flag pattern, signalling a continuation of the ongoing bullish trend. Despite the selloff on the index, this stock has held strong on friday.\n\nBreakout occurred with good volumes\n\nSL can be taken below the breakout candle low, giving a R:R of 1:1.3, or an SL below the monthly pivot, which would give an R:R of..."], ["COFORGE", "https://s3.tradingview.com/t/T9eeQaWU_mid.png", "#Coforge ready to give 9% upmove, RSI breakout trade", "1W", "ssudhirsharma11", 1670769314.0, "🟢", "As per weekly chart Coforge is looking quite strong, Weekly RSI has already broken out of its resistance of 48. Personally I would want weekly RSI to be above 55 for bigger upmove or price to give pullback to 3645 levels. I will be keeping eye on this counter for quick 5-6% gain if price sustain above 3700 levels, or price to give pullback to 3645 level for great..."], ["SKMEGGPROD", "https://s3.tradingview.com/w/WlrCPajE_mid.png", "SKMEGG Products - Bullish triangle breakout", "1W", "Share_Singh", 1670769122.0, "🟢", "Weekend Pick 3: SKMEGG Products\n\nFundamentals : Decent, Healthy Dividend Paying, Strong last quarter, Promotor + FII holding increased! \n\nTechnicals : Bullish, Broken Triangle Breakout with good volumes, 21 EMA crossing 50 EMA. \n\nR 1 : 170\nR 2 : 195\nR 3 : 220\n\nS: 105"], ["OBEROIRLTY", "https://s3.tradingview.com/u/umaeSCsX_mid.png", "Oberoi Reality ready to change its reality", "1W", "ssudhirsharma11", 1670769088.0, "🟢", "Weekly chart of Oberoi Reality reaching near resistance of 1050 which was made in Nov'21. There can be 2 scenarios 1) Wait for pullback (if Nifty corrects) to 994-1000 zone which will give best R:R, 2) if close above 1050 then can enter for targets 1) 1142 2) 1189. SL any day closing below 964"], ["TATACONSUM", "https://s3.tradingview.com/s/s14WxW2Y_mid.png", "lomg", "1W", "atharva_deote", 1670769082.0, "🟢", "Tata Consumer Products Ltd. is one of the leading companies of the Tata Group, with presence in the food and beverages business in India and internationally. It is the second largest tea company globally and has significant market presence and leadership in many markets. In addition to South Asia (mainly India), it has presence in various other geographies..."], ["DIVISLAB", "https://s3.tradingview.com/c/Cg4JANUx_mid.png", "Divislab available at good support price, 3-5% quick gains", "1W", "ssudhirsharma11", 1670769053.0, "🟢", "In Monday's probable gap down, Divis lab should be available at good weekly support price of 3370-3463 price range. If anyone able to enter in this price range then targets 1) 3676 2) 3797. Weekly hammer candle also seen, keep eyes open for quick scalping of 3-5% gains."], ["CROMPTON", "https://s3.tradingview.com/v/V7kVs78t_mid.png", "Crompton greaves W pattern waiting for breakout", "1W", "ssudhirsharma11", 1670769031.0, "🟢", "Crompton greaves making 2 of my favourite setup's in weekly TF, W pattern & inside candle consolidation. Weekly RSI & ADX +DI also ready to blast, above 411, 434, 457 can come immediately.  Only dampener can be correction in Nifty else every thing looks good here."], ["CLEAN", "https://s3.tradingview.com/l/LbXi6Pi4_mid.png", "triple double bottom or simple support resistance", "1W", "suhailafzalkhan", 1670769001.0, "🟢", "Clean science one of the favorite stock of mine  \ncan entry at cmp or after daily or wqeekly cancle close \nlooking good as it took support from these level on weekly tf \na very good risk : reward\n\nKeep SL as your risk appetite - a part of a game \ntaget metioned on the chart\n\n\n\n\ni am not a sebi register adviser \nits my own analysis \npls make sure you do your..."], ["BLUESTARCO", "https://s3.tradingview.com/x/xbnDQpW1_mid.png", "Bluestar, another star waiting to explode above 1085", "1W", "ssudhirsharma11", 1670768975.0, "🟢", "Weekly chart of Bluestar shows promise, I have been tracking this stock for last 1 year now. From 8th Nov 2021 price resistance of Rs 1085 been multiple times tested, 2 consecutive daily closing above this level can bring fresh momentum. If you are a breakout trader (keeping yesterday correction in Nifty), enter only with 50-60% of plan qty and pyramid more once..."], ["TANLA", "https://s3.tradingview.com/q/qUyvGELa_mid.png", "Weekly chart of Tanla platform", "1W", "ssudhirsharma11", 1670768879.0, "🟢", "Weekly chart of Tanla Platform, although I am not in favour of catching a falling knife but risk reward is looking to good to miss out. Price has taken support at low of Dec'20 and reversed. There is some change of hands kind of volume by company called \"XTX markets LLP\" on 27th July, but can see some volume post that also. People who have missed out riding..."], ["JMCPROJECT", "https://s3.tradingview.com/w/WJjAg14r_mid.png", "JMC Projects Bullish triangle breakout", "1W", "Share_Singh", 1670768351.0, "🟢", "Weekend Pick 2: JMC Projects\n\nFundamentals : Decent, Consistent Sales Growth,  Strong Parent Group - Kalpatru ! \n\nTechnicals : Bullish, Broken Triangle Breakout with good volumes, 21 EMA crossing 50 EMA. \n\nR 1 : 150\nR 2 : 175\nR 3 : 200\n\nSL : 90"], ["SHALBY", "https://s3.tradingview.com/u/uqDlHw1v_mid.png", "Shalby Limited", "1W", "ajaydhakadiaf", 1670768184.0, "🟢", "SHALBY:- Stock has formed head and shoulders pattern, going to breakout soon, keep an eye.\n\n\n\n\nHello traders,\nAs always, simple and neat charts so everyone can understand and not make it too complicated.\nrest details mentioned in the chart.\nwill be posting more such ideas like this. Until that, like share and follow :)\ncheck my other ideas to get to know about all..."], ["ASIANPAINT", "https://s3.tradingview.com/n/nvBgx0J4_mid.png", "Asian paints", "1W", "HarishRaoYT", 1670768029.0, "🟢", "w pattern bulid chart in weekly chart\ncandle confrimation\nrsi divergence\nmacd ready to green crossover\ngreen volume come day by day"]]}