{"last_run_values": [["L_TFH", "https://s3.tradingview.com/w/WOhY3upo_mid.png", "Double Bottom(W) Breakout at L&T Finance Holdings Ltd", "1W", "ratneshr", 1670139764.0, "🟢", "Double Bottom(W) #Breakout at #L_TFH (L&T Finance Holdings Ltd) Weekly Chart. Soon its #Outperformed #Nifty.\n\nBSE: 533519 / NSE : L&TFH\n\nWhat Is a Double Bottom?\n\nA #doublebottom #pattern is a technical analysis charting pattern that describes a change in trend and a momentum reversal from prior leading price action. It describes the drop of a stock or index, a..."], ["MUTHOOTFIN", "https://s3.tradingview.com/p/PogFx8ld_mid.png", "This is weekly chart time frame of MUTHOOTFINANCE!", "1W", "shoaibsorathiya28", 1670139030.0, "🟢", "One can go long in this particular stock for positional, as it has taken good support on weekly time frame & can give potential target upto 20% from current level..."], ["HINDALCO", "https://s3.tradingview.com/x/XR1U47Ac_mid.png", "Hindalco Short Term", "120", "Singh_Siddz", 1670138837.0, "🔴", "Hindalco Short Term\n\nAs of now at resistance. \n\nCan go short below 458 \nwith SL of 471 to start with and then can be trailed ."], ["MFSL", "https://s3.tradingview.com/7/7UCtlS0T_mid.png", "MFSL: Equally Poised in either directional movememt", "15", "pradipandsuvra", 1670138745.0, "Not Mentioned By Author", "The  NSE:MFSL  is showing the previous High High (point #3 in chart) or Higher Low (point #4 in the chart) as the range bounded movement.\nPotentially the move can happen in any direction.\nBut quite likely it will be in upside only as the volume buildup is positive and increasing.\n\n Trade : Both sides ( green color price tags for Long, red color price tags for..."], ["KOTAKBANK", "https://s3.tradingview.com/b/bvasRQWh_mid.png", "Buy jsw steel", "1D", "sauravyadav2909", 1670138247.0, "🟢", "Its looking like Jsw steel is going too give breakout because it has already tested 3 times \nso there are possibilities that it may break ."], ["INDUSINDBK", "https://s3.tradingview.com/i/ILN0QUld_mid.png", "Breakout stocks for 05-12-2022", "1D", "Bengaluru_Expert_Traders", 1670137576.0, "🟢", "Thanks to Trading view platform viewers and subscribers for appreciating, subscribing and following us channel. I have brought one stock for you guys that is #indusind"], ["JUBLFOOD", "https://s3.tradingview.com/4/4XQ1QLd3_mid.png", "JUBLGFOOD: Short Patten prominent", "60", "pradipandsuvra", 1670137437.0, "🔴", "NSE:JUBLFOOD , in hourly chart showing a clear downtrend after breaking one lower lows. \nThen after making a nice up move upto point 4 in the chart, it unables to break the double-bottoms (1 and 3)  W patten. At that time the volume candle was high. So it actually reinforces the downtrend.\n\nLets wait for it to break down the price corresponds to point #3 in the..."]]}