{"last_run_values": [["HCC", "https://s3.tradingview.com/1/1WcK2wWn_mid.png", "Long Setup", "60", "kaushal1403", 1669974715.0, "Not Mentioned By Author", "i'm missed this stock because techanical problem. Go long above 17.95 for short term period."], ["ULTRACEMCO", "https://s3.tradingview.com/e/EshGjE2K_mid.png", "Ultra-tech rallies as NIfty infra started to move", "1D", "Gagan_Ahuja_13", 1669974671.0, "🟢", "NSE:ULTRACEMCO  \nUltra tech can be a leader in the Nifty Infra rally So eyes are on it."], ["TCS", "https://s3.tradingview.com/n/nbyC638m_mid.png", "Reason for why should you watch TCS !!", "1D", "Gagan_Ahuja_13", 1669974268.0, "🟢", "TCS has given a breakout today & it's also at a good level to catch\nWhy TCS over all other IT Stocks    NSE:TCS \n\nReason: Strength\nWhen all others were in sell-off facing selling Pressure. It was the only standing man. Where the candles were forming was quite demanding.\n\nSimilarly, I've told some stocks in the Nifty Infra setup  NSE:ULTRACEMCO   NSE:GRASIM \n..."], ["NCC", "https://s3.tradingview.com/7/7MiChiUU_mid.png", "NCC is a buy now", "D", "vandana_nagar_007", 1669974246.0, "🟢", "Entry - 80.50\nEntry reason - Near 52 week break out region\nSL - Closing below 78.50\nTarget - 85"], ["ESCORTS", "https://s3.tradingview.com/q/QpEcbf8S_mid.png", "Range breakout-", "1D", "sanjay.prajapat.311", 1669973981.0, "🟢", "chart has broken out of range and as per simple calculations its heading towards 2400."], ["LUPIN", "https://s3.tradingview.com/5/5ypWgyln_mid.png", "DOUBLE BOTTOM", "1M", "AMIT-RAJAN", 1669973843.0, "🟢", "Hello mates, As I know that this is month starting and this is not a appropriate time to analyze a chart on monthly time frame but I want to go some in deep to find out a pattern or kind of a reversal signs from strong support zones in it in Lupin so I may be find out some useful things could help someone that is all that it breaks a falling trendline on monthly..."], ["UPL", "https://s3.tradingview.com/e/EvST08zM_mid.png", "Multi time frame bullish breakout", "1D", "nsdtrading", 1669973578.0, "🟢", "1. Symmetrical triangle pattern breakout on daily chart\n2. Stock gave a Symmetrical triangle pattern breakout on 2 hour chart and retesting the breakout levels.\n\nTarget and SL are as shown on chart"], ["RICOAUTO", "https://s3.tradingview.com/m/m4n0g0aX_mid.png", "Inverse Head and Shoulders Breakout at RICOAUTO", "1W", "ratneshr", 1669972005.0, "🟢", "Inverse Head and Shoulders #Breakout at #RICOAUTO (Rico Auto Industries Ltd) Weekly Chart. Its #Outperformed #Nifty\n\n BSE: 520008 / NSE : RICOAUTO\n\nWhat Is the Inverse Head and Shoulders?\n\nAn inverse head and shoulders, also called a \"head and shoulders bottom\", is similar to the standard head and shoulders pattern, but inverted: with the head and shoulders top..."], ["WIPRO", "https://s3.tradingview.com/x/XuE4CNXH_mid.png", "Wipro Breakout and then move for 10%-20%", "1D", "siddmuk2005", 1669970978.0, "🟢", "Wipro is near breakout zone,  for break from 415 the 460 is coming in short duration"]]}