{"last_run_values": [["SOTL", "https://s3.tradingview.com/r/rxu4Xwzr_mid.png", "SAVITA OIL TECH - Explosive Hunch", "1W", "CautiousChartist", 1670316472.0, "🟢", "Fundamentally Strong + Technically Strong + Early Entry =  MULTIBAGGER \n\nSavita Oil Technologies Limited, established in 1961, is a specialty petroleum products company engaged in manufacturing Transformer Oils, Liquid Paraffins, White Oils, Automotive and Industrial Lubricants, Coolants and Greases. A wide range of lubricants, greases, and coolants of the Co are..."], ["TWL", "https://s3.tradingview.com/6/6RbG4Lk3_mid.png", "TWL moving towards All time high", "1W", "pkindian01", 1670315712.0, "🟢", "TWL is breaking out of a strong resistance level, if it sustains above 190 on weekly closing basis we can expect a 10-15% up move in no time. Keep it in your watchlist."], ["NAUKRI", "https://s3.tradingview.com/f/fa7mJlTn_mid.png", "INFO EDGE weekly chart analysis.", "1W", "ekadarshpanda", 1670314961.0, "🟢", "Buying oppurtunity of info edge after break out.\nlooking bullish after break out with inverted head and shoulder"], ["TATAMOTORS", "https://s3.tradingview.com/z/Zxc28nCD_mid.png", "Tatamotors H&S in intraday", "15", "harish2104gowda", 1670314326.0, "🟢", "Tatamotors looks like making head and shoulder pattern in 5&15 time frame can try to buy cmp\nWith Target of 436 sl 426-425"], ["EXIDEIND", "https://s3.tradingview.com/z/zxmBg5OC_mid.png", "Exide Industries Flag Pattern Breakout", "1D", "zaidsk70", 1670313718.0, "🟢", "The price has bottomed out and reversed from Multiyear Support at around 130-135 INR.\nBroke the previous High on the Daily timeframe and then proceeded to break the Channel pattern on the upside.\nBreakout created a new high (175 INR, which is also 200EMA level   on the weekly timeframe) & Retraced (Failed breakout).\nRetraced and consolidated and then gave a..."], ["DONEAR", "https://s3.tradingview.com/m/mlQ32rY3_mid.png", "DONEAR", "1W", "devbisht5453", 1670313546.0, "🟢", "Round Bottom forming in DONEAR with high volume ..."], ["DIXON", "https://s3.tradingview.com/q/qVVAfPu2_mid.png", "Long Dixon after the BO of resistance level", "60", "Tech_stock_trader", 1670313061.0, "🟢", "Long Dixon after the BO of resistance area above 4385 for the target price of 4600. All important levels have been marked on the charts. Good risk-to-reward ratio. This is for your educational purpose only."]]}