{"last_run_values": [["WIPRO", "https://s3.tradingview.com/l/lCj1vGRr_mid.png", "WIPRO Short", "1D", "SUTHARTRADE", 1671282580.0, "🔴", "Wipro is continuously in downfall and holding the support of level 385.\nNow, it created a pattern of \" head and shoulder \" we may see a good fall if it closes below the bottom of the previous low of the pattern.\nThe share faced rejection of  50DMA  and closed below it again. \n Fib Retracement - Putting the Fib from the Corona time low we came to know the level of ..."], ["MOTHERSON", "https://s3.tradingview.com/b/B2jIENIA_mid.png", "MOTHERSON 9% UP MOVE", "1D", "Manojmkm", 1671282473.0, "🟢", "MOTHERSON 9% UP MOVE \nIF TREND continues it may touch channel high"], ["BERGEPAINT", "https://s3.tradingview.com/z/zZbMYT6x_mid.png", "bergerpaint 6% MOVE POSSIBLE", "1D", "Manojmkm", 1671282312.0, "🟢", "bergerpaint 6% MOVE POSSIBLE\nTREND SUGGEST MOVEMENT 15 days time movement can be seen touching channel top"], ["SIEMENS", "https://s3.tradingview.com/o/oj9odnjl_mid.png", "SIEMENS LOOKING GOOD FOR TOMORROW", "1D", "trading_facts96", 1671282110.0, "🟢", "#SIEMENS... ✅ \n🔹🔹🔹🔹🔹🔹🔹🔹🔹\n👇👇👇👇👇👇👇👇👇👇👇👇  \nINTRADAY/ Short term delivery call as well \n\nAll levels given in charts ... \nIF good potential seen then we work in options also  \nif activate then possible a huge movement Keep eye on this ...  \nWe take trade only when it activates...  \n\nPossible to give good target \n👍👍👍👍👍👍👍👍"], ["CREDITACC", "https://s3.tradingview.com/p/P6X0afZb_mid.png", "Creditaccess consolidating in a range, near 870 grt risk reward", "1W", "ssudhirsharma11", 1671282097.0, "🟢", "Creditaccess consolidating in a range since Apr'22 and whenever this range will break it will just fire up. Now there are 2 options in front of us \n1) Wait for retracement to 870-880 zone which will give great risk reward. Just place alert and wait for trigger\n2) Wait for open above 1090 and then enter. \n3) There is another option, enter near 945 with 33% plan qty..."], ["BAJAJCON", "https://s3.tradingview.com/g/GcG1z1zH_mid.png", "Bajaj Consumer possible target", "1W", "udhayakumars", 1671280342.0, "🟢", "Looks like a breakout on weekly in this stock Bajaj consumers, as per my understanding the following targets might be possible, if I'm not wrong... target 1: 185, target 2: 202 and target 3: 242, lets see if that is possible"], ["TCS", "https://s3.tradingview.com/m/MSI3X1wi_mid.png", "TCS: Excellent opportunity to buy on dips", "60", "sameerthatte", 1671279032.0, "🟢", "In hourly chart: 1-2-3-4-5 corrective wave appears to be over or will have little more room down side. But any downward movement would be an opp0rtunity to accumulate on dips. +ve divergence RSI from19.32 to 25.42 can be observed.\n\n\n in.tradingview.com"], ["NFL", "https://s3.tradingview.com/4/4JGURnpu_mid.png", "TWO PROBABLILITIES PART TWO", "1D", "AMIT-RAJAN", 1671278097.0, "🟢", "Here I am sharing the daily chart of National fertilizer it gives a bullish breakout on daily time frame on horizontal resistance with good volume jump in it so what it could do next for us? what I analyze on this chart is that there are two probabilities sharing below\n\nProbability One-: It can god straight to target of 83 levels from current price which is about..."], ["JKPAPER", "https://s3.tradingview.com/6/6nbSCHbV_mid.png", "JKPAPER", "1D", "prahilgujar", 1671277961.0, "🟢", "Looks Good. The set up is getting tight. Might add some qty on monday, if works well in the morning."]]}