{"last_run_values": [["ICICIBANK", "https://s3.tradingview.com/2/2jt77okm_mid.png", "ICICI Bank Ending Diagonal and RMI", "1D", "indiacharts", 1670320279.0, "Not Mentioned By Author", "An ED also known as a wedge involves five waves marked as a-b-c-d-e that is mainly found in wave 5 of an impulse and marks the end of a trend. Does ICICI Bank display this structure is a good question to ask as the RMI crosses over to the sell side again."], ["INDIANB", "https://s3.tradingview.com/a/ANNqbZ5u_mid.png", "Indian Bank C&H Breakout", "1W", "poddaraditya11", 1670320263.0, "🟢", "Beautiful Cup & handle Pattern and breakout in Indian Bank. Entry near 195 (Retest Zone) and fist target comes to 292. The stock is had also started making HH-HL formation. SL - Weekly Closing below 173. Favorable RR."], ["ITDCEM", "https://s3.tradingview.com/p/pml4q6sk_mid.png", "ITDCEM on Breakout. recommended BUY above 130", "D", "Jibij", 1670320068.0, "🟢", "ITDCEM on Breakout and with good volume. Recommended BUY above 130 tomorrow (Tuesday 6th December)\n\n\nThe information is not meant to be, and do not constitute, financial, investment, trading, or other types of advice or recommendation.\n\n INTRADAY Trading Strategy based on 3 stages of a breakout: \n\n 1) Impulse upmove stage:  The strong upmove (nearly upto 2% from..."], ["GMRINFRA", "https://s3.tradingview.com/1/12Zq7O36_mid.png", "GMR Infra short position", "1D", "chaitanya1998", 1670319492.0, "🔴", "Short after the day's low breaks with a strict SL (day's high)."], ["EICHERMOT", "https://s3.tradingview.com/s/SG4zkzrf_mid.png", "#EicherMotor, Short setup for 1.5-2.25% gains in F&O", "1W", "ssudhirsharma11", 1670319348.0, "🔴", "On Weekly TF Eicher motor has made inverted hammer candle and I am looking to initiate short trade below 3325. If Eicher open flat on Monday then will initiate short trade below 3325, if open gap up then will wait for rejection around 3370 and then initiate trade this will give great risk reward. If open gap down then need to wait to take rejection around 3325..."], ["MINDACORP", "https://s3.tradingview.com/k/kjjesuOf_mid.png", "Stock Preparing to buy on dip", "1D", "upparavinod16", 1670318275.0, "🟢", "It broke up the trend line and it taking retrace now, i think it is right time buy\n\n\n\nThis is only for educational purpose only"], ["REDINGTON", "https://s3.tradingview.com/l/LbE8Ely9_mid.png", "Redington breaking out of consolidation", "60", "pkindian01", 1670317912.0, "🟢", "Redington is breaking out of a good consolidation, my first target would be 200+with a small stoploss."], ["ENGINERSIN", "https://s3.tradingview.com/4/4CbgHAWN_mid.png", "ENGINERSIN", "1D", "rameshavutu", 1670317263.0, "🟢", "#ENGINERSIN  Railwaytrack pattern. Look for 20DMA support tarde\n\n#Educational purpose only"]]}