{"last_run_values": [["MCX", "https://s3.tradingview.com/u/USr7gNIY_mid.png", "STEP BY STEP EXCHANGING CHANNELS", "60", "AMIT-RAJAN", 1671475657.0, "🟢", "MCX is looking that next breakout will happen very soon in this stock so I try for how when and why logic in this chart, as we can see on daily chart I am sharing below that it was a clear breakout on at 1490 levels so after that breakout it continue trading in parallel channels and each time when it breaks pervious channel it shift it's trading in to new channel..."], ["ADANIENT", "https://s3.tradingview.com/z/zhByKMzf_mid.png", "ADANIENT | Good for Long", "1D", "LIHKA_Stocks", 1671473687.0, "🟢", "NSE:ADANIENT \n\nCmp : 4075\n\nEntry : Above 4110\n\nStop Loss: According to one's Risk Reward ratio\n\n\n#Study, Learn & Earn.\n\nIf you love this post please like and comment your thoughts below. That will be a great motivation for me to post similar ideas ahead.\n\nDisclaimer: All the information posting on this page are for the educational purpose only, we are not SEBI..."], ["SUZLON", "https://s3.tradingview.com/7/7mJwYvfc_mid.png", "SUZLON ENERGY LTD ,  TIMEFRAME 1W", "1W", "trading360degreeee", 1671473366.0, "🟢", "We can see a suzlon energy formed CUP & HANDLE pattern in 1W timeframe. Currently trading at 11.65 level having high value on closing basis compare to previous almost 4 & half year. Having immediate resistance of 12.05 level. Also break 500 moving average line on Weekly timeframe on closing basis first time, indicating bullishness. \nIf suzlon break level of 12.05..."], ["EICHERMOT", "https://s3.tradingview.com/p/Pq6vqasl_mid.png", "EICHERMOTOR retest after breakout", "1W", "moodyyogesh", 1671473304.0, "🟢", "EICHERMOTOR retest after breakout we can ride it for more then 80% gain think to accumulate in your portfolio.."], ["UTIAMC", "https://s3.tradingview.com/l/lIu8vmQS_mid.png", "UTIAMC for 15% Gain approx..", "1D", "moodyyogesh", 1671472208.0, "🟢", "In UTIAMC volume breakout as per on chart and news support it \nLTP : 860\nTG : 1000\nSL : Below 850"]]}