{"last_run_values": [["ABB", "https://s3.tradingview.com/y/y5S8A9Xm_mid.png", "ABB Breakdown Analysis", "1D", "Swing_trader_87", 1671187566.0, "🔴", "Abb India has broken down. \nLots of loss in volume observed validating the breakdown. \nTarget 2559\nCMP 2976"], ["GRASIM", "https://s3.tradingview.com/w/wweZnwiO_mid.png", "Why Grasim can blast a brief anaysis!!", "1D", "Gagan_Ahuja_13", 1671187262.0, "🟢", "NSE:GRASIM  is looking Good to enter if you want to invest in Nifty Infra for the upcoming weeks. \n\nEven though volatility in the market has started to increase. It is stable and holding its levels Positively.\n\nWith every Swing in it, volatility is reducing & it can give huge returns in a shorter period.\n\nOne Can take Stop loss near the zone of 1760 (Tight SL) and..."], ["EPL", "https://s3.tradingview.com/o/O0qYOjT9_mid.png", "EPL on Breakout. BUY above 193.5 for Intraday on Monday", "D", "Jibij", 1671186811.0, "🟢", "EPL on Breakout and with good volume . BUY above 193.5 on Monday 19th December for Intraday gains\n-------------------------------------------------------------\n\n\n INTRADAY Trading Strategy based on 3 stages of a breakout: \n\n 1) Impulse upmove stage:  The strong upmove (nearly upto 2% from breakoutprice) happens within the first five to 15 minutes. \"High Risk..."], ["PEL", "https://s3.tradingview.com/u/udhEqFiU_mid.png", "Double top in PEL ???!!!", "120", "mmjimm", 1671185979.0, "🔴", "Chart clearly depicts the pattern. \n\n PEL  - Primary trend is  Bearish. \n\n Double top  - with  2nd top having high lower than the 1st top . \n\nPreviously there was a double bottom like formation, but the 2nd bottom low was lower than the 1st bottom's low.\n\nLet's see whether this double top works or not !!!! \n\n Entry only after the breakdown of the white dashed..."], ["JUBLFOOD", "https://s3.tradingview.com/3/3N45iL3q_mid.png", "JUBLFOOD Next Down Move started ????", "1D", "mmjimm", 1671185960.0, "🔴", "Chart looks Prudent for yet  another down move !!! \n\nThis is in  continuation of the idea posted about jublfood few days back...Refer to it... I have attached below the link to it.(under related ideas) \n\nTarget and SL levels (dashed lines) mentioned in chart.\n\n Be cautious if it breaks above the resistance line(thin red trend line)  of the descending channel down..."], ["SRF", "https://s3.tradingview.com/c/cioAOGjW_mid.png", "SRF at its MAKE or BREAK point !!!!!", "1D", "mmjimm", 1671185929.0, "Not Mentioned By Author", "SRF is travelling in a  Descending channel pattern .\n\nNow, it is at crucial point for either  Breakout or Breakdown!!! \n\nMake it to Watchlist !!\n\nWill update the levels once it gives the movement with volume!!\n\nLet's wait and watch how it moves!!!!\n\n\nNote - Just sharing my view.....not a tip nor advice!!!!"], ["NFL", "https://s3.tradingview.com/p/pcQ7P3h4_mid.png", "TWO PROBABILITIES", "1D", "AMIT-RAJAN", 1671185324.0, "🟢", "Here I am sharing the daily chart of National fertilizer it gives a bullish breakout on daily time frame on horizontal resistance with good volume jump in it so what it could do next for us? what I analyze on this chart is that there are two probabilities sharing below\n\nProbability One-: It can god straight to target of 74 levels from current price which is about..."], ["ADANIENT", "https://s3.tradingview.com/t/TWTdXs8h_mid.png", "RISING WEDGE BREAKDOWN", "1D", "midhun19932", 1671185153.0, "🔴", "one can short adani at breakdown point with stopp loss on the top of the wedge , take your own analysis and trade\n\nCP 3980\nSL 4020\n\ntarget  3600++++"], ["VGUARD", "https://s3.tradingview.com/s/s2VoXZp3_mid.png", "VGUARD - Breaking 5yr consolidation range- 45% upside potential", "1W", "skandha1986", 1671184727.0, "🟢", "VGUARD is at the upper range of 5 year consolidation, near 270 levels.\nA weekly close above 270 levels will give confirmation on new upside journey.\nTarget is coming to 355 and 395 levels.\nTarget timeframe: 3 to 6 months.\nNote: Since the consolidation is around 5 yrs, we may see a new bull run after breakout at 270 levels with good volumes. Can expect 2x / 3x..."]]}