{"last_run_values": [["BATAINDIA", "https://s3.tradingview.com/r/RupMWTzA_mid.png", "BATAINDIA Down to its major support ??!!", "1D", "mmjimm", 1671162582.0, "🔴", "Chart patterns suggests the above opinion... \n\n1. It is travelling in a   7 year channel pattern from 2015.(red and green line) \n2. I noticed the shorting possibility at the purple trendline breakdown...forgot to add the idea here.\n3. Now, it has formed a  beautiful bearish flag and given breakdown again (giving a target downside to roughly 130points)\n4. Target..."], ["MAHINDCIE", "https://s3.tradingview.com/c/Ca20DACt_mid.png", "MAHINDCIE", "1M", "ajaydhakadiaf", 1671162181.0, "🟢", "MAHINDCIE:- formed head and shoulder pattern, wait for proper breakout. keep on eye\n\n\n\nHello traders,\nAs always, simple and neat charts so everyone can understand and not make it too complicated.\nrest details mentioned in the chart.\nwill be posting more such ideas like this. Until that, like share and follow :)\ncheck my other ideas to get to know about all the..."], ["TECHM", "https://s3.tradingview.com/d/dNFQx1M0_mid.png", "TECHM 1D", "1D", "AS_Vishwakarm", 1671161966.0, "🔴", "TECHM: Break Support Test 5th time!!!\n\nWe can go for Short opportunity in TECHM.\n\nWish you Happy & safe Trading.\n\nCheers,\n AS_Vishwakarm \n\nPlease Note:\nI am not SEBI registered analyst.\nMy studies are for educational purpose only.\nPlease consult your financial advisor before Trading or Investing.\nI'm not responsible for any kinds of your Profits & Losses."], ["KRISHNADEF", "https://s3.tradingview.com/g/gVWSUw6G_mid.png", "krishna defence and allied industries", "1W", "rrgiyer", 1671161784.0, "Not Mentioned By Author", "One of the IPO stocks of last year with issue price of 39 and listing of 94. Has seen correction from IPO listing levels of Rs 50 almost 40% correction. The stock is now on upmove. It had given a cup and handle breakout and rebounded from  its 1.618 levels.  The stock has also shown increasing volumes and RBI is also on rise. if the stock moves past the 1.618..."]]}