{"last_run_values": [["INTELLECT", "https://s3.tradingview.com/j/jy0CsVYD_mid.png", "Intellect Design for Next Few Days", "1D", "krushi1897", 1670773199.0, "🔴", "NSE:INTELLECT \n\n Analysis after 9th dec 2022 closing \n\n Wave Count -   Last leg for C wave is remaining.\n Berish Revered Divergence -  which indicates  buyers exhausted. \n Weekly TF -  Last week closing was formed  bearish engulf  candle for  Weekly TF. \n\n What if Analysis, \nNext T. Day if Huge GAP UP wait for to break  420 Rs support  for  confirm Entry. \n\n..."], ["NCC", "https://s3.tradingview.com/k/KrQIrUCh_mid.png", "Another buy pick NCC / Do follow", "1W", "vkfincare09", 1670772706.0, "🟢", "here is the new technical analysis of NCC \nIt has given a breakout of flag and retested it, price target and stop loss on the chart \n and don't forget  to like and follow"], ["JAIBALAJI", "https://s3.tradingview.com/s/sx52P1Kv_mid.png", "Nice one ✌✌✌", "1W", "DY9772", 1670771932.0, "🟢", "This scrip is expected to give channel pattern breakout in the coming days and you can keep this stock as your short term pick. So traders kindly add this stock to your watchlist and try to catch the momentum. Thanks to all 🙏🙏🙏"], ["HDFCBANK", "https://s3.tradingview.com/n/Ns46pb9w_mid.png", "pole and flag pattern", "1D", "addictedrj22", 1670771806.0, "🟢", "HDFC bank daily chart shows pole and flag pattern great chance to come"], ["UBL", "https://s3.tradingview.com/r/Rw7vf7i0_mid.png", "UBL VCP PATTERN", "1W", "stockartx", 1670771405.0, "🟢", "One can add 25% position 1787 and if price retrace add more. A classic VCP pattern.\n\nhart is self explanatory. Levels of breakdown, possible down-moves (where stock may find support) and resistances (close above which, setup will be invalidated) are clearly defined.\n\nDisclaimer: This is for demonstration and educational purpose only. This is not buying or selling..."], ["GODREJCP", "https://s3.tradingview.com/0/07myQUxi_mid.png", "#GODREJ", "1W", "MakarandK", 1670770981.0, "🟢", "Godrej Consumer 1W:  It is moved almost 15% in last one month.  Relative strength excellent. 3 wave is in play.  RSI has given BO before price & MACD is turning +Ve.  Price is ready to BO above 940.  Keep fingers crossed,"], ["YESBANK", "https://s3.tradingview.com/q/qSI6Sk4L_mid.png", "#YESBANK", "1W", "subbu_1915", 1670770353.0, "🟢", "this stock is looking good bcoz bank is performing well post its poor days, able to regain its lost fame, refer chart for support and targets in weekly time frame."], ["MARUTI", "https://s3.tradingview.com/t/t3Pn6Uvd_mid.png", "Perfect Bear pattern on Maruti Chart , Personally love to buy", "1D", "PrakashPal", 1670770330.0, "🟢", "Perfect Bear pattern on Maruti Chart , Personally love to buy at 8613/- , Also latest oil cap on Russia may provide more bearish impact on Automobile sector . For me its perfect time for Buying Maruti"]]}