{"last_run_values": [["STLTECH", "https://s3.tradingview.com/b/bLzCzvjj_mid.png", "Sterlite Technologies Limited", "1D", "RK_Charts", 1671197071.0, "🟢", "This one stock is roaring bullishly in this bearish market, the stock has been rallying since the last three sessions and there seems to be no stopping in near time. After yesterday’s 4% rally, the stock again surged 4% in the early trade, as its demand is not seeing any signs of suppression. Finally, today it has given breakout with good intensity of volumes on..."], ["VSSL", "https://s3.tradingview.com/b/bpPjMrHi_mid.png", "BULLISH FLAG BREAKOUT ON WEEKLY CHARTS", "1W", "TradingAlertss", 1671196690.0, "🟢", "VSSL has given a bullish flag breakout on weekly charts. Breakout is supported by volumes. Length of pole is 244. Breakout at 280. So target comes to 524/-. SL can kept below 260/-."], ["MADRASFERT", "https://s3.tradingview.com/z/zb9jcAmK_mid.png", "MADRAS FERTILIZERS TARGET 106", "1W", "ganeshkrupa", 1671195702.0, "🟢", "MADRAS FERTILIZERS monthly breakout and weekly bullish in long consolidation. Fiver years consolidation breakout. Next target 106"], ["KOTAKBANK", "https://s3.tradingview.com/m/m3VtcYQG_mid.png", "KOTAKBANK", "1W", "sabarib23", 1671195656.0, "🔴", "we are in c wave triangle brekedown soon  target 1571"], ["NFL", "https://s3.tradingview.com/m/Mi6BuWOg_mid.png", "NFL TARGET 119", "1W", "ganeshkrupa", 1671195491.0, "🟢", "NFL monthly down trend breakout and weekly breakout with bullish. If it open above 75 and sustain above 77 it will reach 89.90. Second target 119"], ["WIPRO", "https://s3.tradingview.com/y/YX5cGpKM_mid.png", "Wipro trend", "1D", "udhayakumars", 1671191842.0, "🟢", "Today Nasdaq and IT sector took support, wipro also formed a doji in the support which clearly indicates more upside possible in this stock"], ["INFY", "https://s3.tradingview.com/8/8wH7niNA_mid.png", "Infosys", "1W", "udhayakumars", 1671191775.0, "🟢", "Infosys support will help it to travel in the channel, if T1 is broken T2 will be possible in the coming days"]]}