{"last_run_values": [["BSOFT", "https://s3.tradingview.com/h/HpletFNM_mid.png", "BSOFT Buy opportunity Intrady or Possible Swing Trade", "1D", "AfnanTAjuddin", 1671687844.0, "🟢", "OUR ANALYSIS, WHICH WE DID ON NOVEMBER 23, WAS ACCURATE; AS WE EXPECTED, BSOFT MOVED UPWORD VERY SHARPLY AROUND 18% FROM DEMAND ZONES.\n\nWe now have another buying opportunity on Bsoft as a retest of the breakout after a month. again This trade will have a low risk and high reward.\nPlease like it if this analysis was helpful to you, follow me for such analysis...", 241], ["IBULHSGFIN", "https://s3.tradingview.com/6/6A4agntq_mid.png", "Breakout retest and Bullish RSI Divergence", "1D", "anuragmundra", 1671687688.0, "🟢", "Indiabulls Housing Finance is showing a Breakout retest after showing a Bullish RSI Divergence on the Daily timeframe. Hilega-Milega is positive and RS 55 is bullish as well. Stock is near the high of the previous day after range contraction for 2 days continuously.", 220], ["RELIANCE", "https://s3.tradingview.com/d/DG7Ir9rz_mid.png", "reliance", "15", "vk447376", 1671687315.0, "🔴", "Reliance descending Triangle Pattern wait for break down ,okh", 56], ["ICICIBANK", "https://s3.tradingview.com/i/ixC2ZXQ5_mid.png", "ICICIBANK at make it or break it moment", "1D", "BharatAsani", 1671686616.0, "Not Mentioned By Author", "ICICI is getting support at an upward trendline, If the support holds we can expect it to head above 950 levels if it fails then we can see it fall below 900 levels. next few days PA will be very crucial.\n\nNote : India Inflation numbers coming out today & US inflation numbers coming out tomorrow.", 27], ["COLPAL", "https://s3.tradingview.com/r/r58Lw4zv_mid.png", "long trade", "15", "rachanak", 1671686580.0, "🟢", "staying long for targets given in chart above\nbuy is based on ichimoku analysis\ndisclaimer - trade @ own risk", 2006], ["IOB", "https://s3.tradingview.com/s/S3V6TvcH_mid.png", "Buy IOB to get short term target of 37.30 and if sustain T2-62", "60", "arun4invest2020", 1671686454.0, "🟢", "According to the Monthly, Quarterly, time frame it seems to heavy bullish", 9], ["PEL", "https://s3.tradingview.com/u/udhEqFiU_mid.png", "Double top in PEL ???!!!", "120", "mmjimm", 1671686184.0, "🔴", "Chart clearly depicts the pattern. \n\n PEL  - Primary trend is  Bearish. \n\n Double top  - with  2nd top having high lower than the 1st top . \n\nPreviously there was a double bottom like formation, but the 2nd bottom low was lower than the 1st bottom's low.\n\nLet's see whether this double top works or not !!!! \n\n Entry only after the breakdown of the white dashed...", 32], ["UJJIVANSFB", "https://s3.tradingview.com/r/rgI45fKQ_mid.png", "Looking good for long", "1W", "sinless_bloke", 1671686077.0, "🟢", "waiting for good follow up. can easily target for 0.62, 1 and 1.2 fib level which are major resistance", 8], ["TATASTEEL", "https://s3.tradingview.com/l/lPvxJlE9_mid.png", "short on tata steel 1D", "1D", "ashutoshtradingYT", 1671685428.0, "🔴", "uper ke side 116 ek major resistantce ban raha he. or niceh ek trendline break kyia he.\n\nso agar niche niklta he to 112 ka stoploss or 103 target plan kar sakte he", 19], ["IGL", "https://s3.tradingview.com/t/TmaDE1Oa_mid.png", "Rising wedge pattern IGL", "1D", "TradZoo", 1671685179.0, "🔴", "IGL\n\nKey highlights: 💡⚡\n\n📈On 1D Time Frame Stock Showing Breakdown of Rising wedge Pattern .\n📈 Strong bearish Candlestick Form on this timeframe.\n📈It can give movement up to the Breakdown target of below 378-.\n📈Can Go Long in this stock by placing a stop loss above 445+.\n📈 breakdown this can give risk:reward upto 1:4+", 18305], ["ICICIBANK", "https://s3.tradingview.com/z/Z2sXiXyL_mid.png", "icici bank", "15", "vk447376", 1671685031.0, "🟢", "wait for icici bank confermation where is going market ,okh", 56], ["INFY", "https://s3.tradingview.com/p/pvacZNHS_mid.png", "INFY looks good for longs", "1D", "BharatAsani", 1671684991.0, "🟢", "INFY has taken support at Nov Low & is showing bullishness from the demand zone there, it looks like a good buy with a good RR. Break below 1482 will negate this view, it should test 1670 levels in the next 2-4 weeks. Once it starts showing bullish momentum then it will become unstoppable.", 27]]}