{"last_run_values": [["INDUSINDBK", "https://s3.tradingview.com/o/Ot27lTQs_mid.png", "INDUSINDBK IS LOOKING GOOD FOR AVERY GOOD SWING TRADE IN 1W/1D.", "1W", "alankarlilare36", 1670150704.0, "🟢", "Indusindbk is looking good for a swing trade. one can take a trade after own research and analysis.\n\nWe are not SEBI registered"], ["NATIONALUM", "https://s3.tradingview.com/v/Vs2ZqPHx_mid.png", "Must See This", "1W", "MAYANKTECHRESEARCHING", 1670150625.0, "🟢", "Hello everyone, Today I am again here with a new swing trade NATIONAL ALUMINIUM as you can see it has made a double bottom and a support at 200 ma and also rsi is heading upwards towards 70 and 80 and when you go to Monthly Chart you will find that a very previous line that is supporting it at this point and if you watch its nature it is a stock that when moves up..."], ["BPCL", "https://s3.tradingview.com/o/oEtzclfa_mid.png", "TRIANGLE BREAKOUT BPCL", "1W", "AMIT-RAJAN", 1670149907.0, "🟢", "BPCL looks good come out from triangle and gives a breakout it takes a falling resistance many time from the upper line of that triangle which finally broken out and gives a close on above that line so we can expect that bullish momentum will continue in this stock looks good for positional players as the looking targets are big. Happy Investing and trading Guys..."], ["L_TFH", "https://s3.tradingview.com/z/zbqAbxhj_mid.png", "L&T Finance holdings", "1W", "TheUnlearningOne", 1670149844.0, "🟢", "Last week the price moved up from a brief consolidation. Watch for price action between 92 and 95. Above 95, can see price go up to 101. And if the momentum continues, 113 is achievable in good time.\n\n80, 72 and 66 can act as good support zones.\n\nNote: Always define stop loss in your trade, usually 5-8%."], ["JINDALSTEL", "https://s3.tradingview.com/j/JgN8cQL7_mid.png", "Jindal Steel Ready For Downside", "1M", "mahetarimtiyaz", 1670149664.0, "🔴", "NEW STUDY FOR PAPER TRADE \n\nFuture Sell/Put Side STUDY \n\nJindalStell@560-577\n\nTARGET:- 550/525/500/450/400\n\nSTOPLOSS:- 585\n\nOnly for Paper Trade And Education Purpose\n\nDon't Real Trade\n\n#Study Logic :\n👉Monthly Supply Zone\n👉Monthly Supply Zone Of Sector Also\n👉RSI TRENDLINE RESISTANCE"], ["ZEEL", "https://s3.tradingview.com/d/dB08X8Jg_mid.png", "ZEE 271 & ichimoku", "1D", "Ichimoku_kumo", 1670148908.0, "🟢", "Zee chart based on ichimoku . Ride The Trend with NinjaMoku !!! \n300 +"], ["LT", "https://s3.tradingview.com/d/DYrmK1XN_mid.png", "LARSEN & TOURBO WAIT FOR BREAKOUT", "60", "StockAnalyst20", 1670148314.0, "🟢", "in this stock price 6 time touch that trend line so now trend line is going to weak so we wait for proper breakout and if market open big gap down then we can't take trade."], ["RECLTD", "https://s3.tradingview.com/e/EaTRR8qq_mid.png", "PERFECT RESISTANCE TRENDLINE", "1W", "AMIT-RAJAN", 1670148215.0, "🟢", "REC here is the perfect example of resistance on the weekly chart of this stock anyhow it gives a breakout on that resistance and closed on above that trendline resistance so we can see coming upside rally in this stock and taking next resistance as a trading target with simple price action based strategy in this counter. Happy investing and trading guys with..."], ["ZENSARTECH", "https://s3.tradingview.com/b/blJoSpqv_mid.png", "Trippel Bottom Breakout", "1D", "Parimalwadiwala", 1670148066.0, "🟢", "Zensar Tech was in Down Trend since Jan'22 and now it has broken up from Trippel Bottom Patten with huge volume spike. Wait to retest the breakout level and go long at around Rs. 230 level with the traget of Rs.252 and stoploss of Rs.225. Risk to Reward ratio is 1:4."]]}