{"last_run_values": [["HERITGFOOD", "https://s3.tradingview.com/w/WepHITEp_mid.png", "heritage foods - breakout", "1D", "rrgiyer", 1671255751.0, "🟢", "The stock has tested the 350 levels multiple times (CMP 348.5) and has showed increased volume, rising MACD and RSI. if crosses immediate resistance of 350-352, upside till 375, 398 and 451 seems possible with trendline support at 332 giving a favourable R:R.\n\nAdded to my watchlist"], ["VSSL", "https://s3.tradingview.com/r/Rfb9TcQM_mid.png", "Vardhman special steel", "1W", "vijay231084", 1671255432.0, "🟢", "Vardhman special steel ( vssl). Good volume seen in mid of 2021 then volume got dried up for 1yrs and again in last week volume shootup this shows some big player was acculamating the stock and force  small player to exit. Earlier rounding bottom target was around 350, current price is near to that target. This stock can be added in small qty at CMP and more on..."], ["STEL", "https://s3.tradingview.com/t/TT1Q7nMe_mid.png", "STEL Holdings - Cup and handle breakout??", "1D", "rrgiyer", 1671254574.0, "🟢", "STEL holdings is giving a cup and handle breakout with higher volume. The CMP is 168.9 . if breaks 169 and sustain upside possible  till 215.85 (previous HH), with resistance at 197.8 (previous LH). support  levels if fails to breakout will be 148.50. R:R loos favourable. added to my watchlist"], ["TVSSRICHAK", "https://s3.tradingview.com/s/STbvcJbY_mid.png", "TVS srichakra", "1W", "vijay231084", 1671254485.0, "🟢", "TVS srichakra.. beautiful \"N\" pattern formation on support level..ready to retest lifetime high level of around 4250. CMP:3226 sl:2930(wcb) Target:3750/4000/4250. If stock sustain in between 4300-4500 level for few week then superb return is expected ..as per pattern stock can move upto 7000-7500 level after breakout."], ["DONEAR", "https://s3.tradingview.com/z/zhdVmuCK_mid.png", "SHORT TERM TRADE", "1W", "Gyanbhuriya", 1671253445.0, "🟢", "good stock for short term and mid term if stock sustain above 92 \nlong term target is 158\nstoploss is is 55 \nrisk reward is 2.8"]]}